//Напишите программу, которая принимает на вход два числа и проверяете, 
//является ли одно число квадратом другого
int a = 9;
int b = 3;
if (a * a == b || b * b == a)
    Console.Write("Yes");
else
    Console.WriteLine("No");
